## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for sandboxy environment...
##
#########################################################

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

#########################################################
##
##   Planning changes for cluster-api environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (25 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "SSH_PRIVATE_KEY"
                                property = "data.SSH_PRIVATE_KEY"
                            }
                            secretKey = "SSH_PRIVATE_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TELEPORT"
                              + property = "data.SSL_CA"
                            }
                          + secretKey = "SSL_CA"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TELEPORT"
                              + property = "data.SSL_CERT"
                            }
                          + secretKey = "SSL_CERT"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TELEPORT"
                              + property = "data.SSL_KEY"
                            }
                          + secretKey = "SSL_KEY"
                        },
                        {
                            remoteRef = {
                                key      = "TF_VAR_PROXMOX_PASSWORD"
                                property = "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                            secretKey = "TF_VAR_PROXMOX_PASSWORD"
                        },
                        # (6 unchanged elements hidden)
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (25 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "SSH_PRIVATE_KEY"
                                metadataPolicy     = "None"
                                property           = "data.SSH_PRIVATE_KEY"
                                version            = null
                            }
                            secretKey = "SSH_PRIVATE_KEY"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "TELEPORT"
                              + metadataPolicy     = "None"
                              + property           = "data.SSL_CA"
                              + version            = null
                            }
                          + secretKey = "SSL_CA"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "TELEPORT"
                              + metadataPolicy     = "None"
                              + property           = "data.SSL_CERT"
                              + version            = null
                            }
                          + secretKey = "SSL_CERT"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "TELEPORT"
                              + metadataPolicy     = "None"
                              + property           = "data.SSL_KEY"
                              + version            = null
                            }
                          + secretKey = "SSL_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "TF_VAR_PROXMOX_PASSWORD"
                                metadataPolicy     = "None"
                                property           = "data.TF_VAR_PROXMOX_PASSWORD"
                                version            = null
                            }
                            secretKey = "TF_VAR_PROXMOX_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                        # (2 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "TF_VAR_pm_api_token_id"
                                metadataPolicy     = "None"
                                property           = "data.TF_VAR_pm_api_token_id"
                                version            = null
                            }
                            secretKey = "TF_VAR_pm_api_token_id"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ conversionStrategy = "Default" -> (known after apply)
                              ~ decodingStrategy   = "None" -> (known after apply)
                              ~ metadataPolicy     = "None" -> (known after apply)
                              + version            = (known after apply)
                                # (2 unchanged attributes hidden)
                            }
                          ~ sourceRef = {
                              ~ generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              ~ storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ conversionStrategy = "Default" -> (known after apply)
                              ~ decodingStrategy   = "None" -> (known after apply)
                              ~ metadataPolicy     = "None" -> (known after apply)
                              + version            = (known after apply)
                                # (2 unchanged attributes hidden)
                            }
                          ~ sourceRef = {
                              ~ generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              ~ storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                            # (1 unchanged attribute hidden)
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ conversionStrategy = "Default" -> (known after apply)
                              ~ decodingStrategy   = "None" -> (known after apply)
                              ~ metadataPolicy     = "None" -> (known after apply)
                              + version            = (known after apply)
                                # (2 unchanged attributes hidden)
                            }
                          ~ sourceRef = {
                              ~ generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              ~ storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                            # (1 unchanged attribute hidden)
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["MachineDeployment-testing-cluster-machinedeploy-workers-clusters"] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_api_manifests" {
      ~ object   = {
          ~ spec       = {
              ~ selector                = {
                  ~ matchLabels      = {
                      - "cluster.x-k8s.io/cluster-name"    = "testing-cluster"
                      - "cluster.x-k8s.io/deployment-name" = "testing-cluster-machinedeploy-workers"
                    } -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
                # (10 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  